In [1]:
import pandas as pd
import numpy as np

### Importing Data

In [2]:
eng=pd.read_csv('Data/eng.csv')
state=pd.read_csv('Data/state.csv')
lib=pd.read_csv('Data/liberal_arts.csv')
ivies=pd.read_csv('Data/ivies.csv')

### Concatenating DataFrames

Firstly we are checking the shape of all the dataframes

In [3]:
dfs=[eng, state,lib,ivies]
for i in dfs:
    print(i.shape)

(19, 4)
(175, 4)
(47, 4)
(8, 4)

Checking for the overlapping school name

In [4]:
len(set(eng['School Name']).difference(ivies['School Name']))

19

In [5]:
pd.concat([eng,ivies]).shape

(27, 4)

So from 27 concatenated values, only 19 rows are different. The rest are same name school

### The Duplicated Index Issue

In [6]:
df = pd.concat(dfs)

In [7]:
df.loc[0]

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00"
0,"University of California, Berkeley",State,"$59,900.00","$112,000.00"
0,Bucknell University,Liberal Arts,"$54,100.00","$110,000.00"
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00"

pd.concat() --> doesn't discard the original index of the dataframe being concatenated

For a non-unique index label we can't use index slicing

In [8]:
df.reset_index(drop=True, inplace=True)

### Enforcing Unique Indices

In [9]:
eng2=eng.set_index('School Name')

In [10]:
ivies2=ivies.set_index('School Name')

In [11]:
pd.concat([eng2,ivies2], verify_integrity=True).head()

,School Type,Starting Median Salary,Mid-Career Median Salary
School Name,,,
Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00"
California Institute of Technology (CIT),Engineering,"$75,500.00","$123,000.00"
Harvey Mudd College,Engineering,"$71,800.00","$122,000.00"
"Polytechnic University of New York, Brooklyn",Engineering,"$62,400.00","$114,000.00"
Cooper Union,Engineering,"$62,200.00","$114,000.00"

### Creating Multiple Indices Using Concat

In [12]:
new_df=pd.concat([eng,ivies], keys=['engineer', 'ivy league'])
new_df

                                                     School Name  School Type  \
engineer   0         Massachusetts Institute of Technology (MIT)  Engineering
           1            California Institute of Technology (CIT)  Engineering
           2                                 Harvey Mudd College  Engineering
           3        Polytechnic University of New York, Brooklyn  Engineering
           4                                        Cooper Union  Engineering
           5               Worcester Polytechnic Institute (WPI)  Engineering
           6                    Carnegie Mellon University (CMU)  Engineering
           7              Rensselaer Polytechnic Institute (RPI)  Engineering
           8                     Georgia Institute of Technology  Engineering
           9                            Colorado School of Mines  Engineering
           10                    Stevens Institute of Technology  Engineering
           11             Illinois Institute of Technology (IIT)  Engineering
           12                  Wentworth Institute of Technology  Engineering
           13  Virginia Polytechnic Institute and State Unive...  Engineering
           14          South Dakota School of Mines & Technology  Engineering
           15  New Mexico Institute of Mining and Technology ...  Engineering
           16            Rochester Institute of Technology (RIT)  Engineering
           17        Embry-Riddle Aeronautical University (ERAU)  Engineering
           18                 Tennessee Technological University  Engineering
ivy league 0                                   Dartmouth College   Ivy League
           1                                Princeton University   Ivy League
           2                                     Yale University   Ivy League
           3                                  Harvard University   Ivy League
           4                          University of Pennsylvania   Ivy League
           5                                  Cornell University   Ivy League
           6                                    Brown University   Ivy League
           7                                 Columbia University   Ivy League

              Starting Median Salary Mid-Career Median Salary
engineer   0             $72,200.00              $126,000.00
           1             $75,500.00              $123,000.00
           2             $71,800.00              $122,000.00
           3             $62,400.00              $114,000.00
           4             $62,200.00              $114,000.00
           5             $61,000.00              $114,000.00
           6             $61,800.00              $111,000.00
           7             $61,100.00              $110,000.00
           8             $58,300.00              $106,000.00
           9             $58,100.00              $106,000.00
           10            $60,600.00              $105,000.00
           11            $56,000.00               $97,800.00
           12            $53,000.00               $96,700.00
           13            $53,500.00               $95,400.00
           14            $55,800.00               $93,400.00
           15            $51,000.00               $93,400.00
           16            $48,900.00               $84,600.00
           17            $52,700.00               $80,700.00
           18            $46,200.00               $80,000.00
ivy league 0             $58,000.00              $134,000.00
           1             $66,500.00              $131,000.00
           2             $59,100.00              $126,000.00
           3             $63,400.00              $124,000.00
           4             $60,900.00              $120,000.00
           5             $60,300.00              $110,000.00
           6             $56,200.00              $109,000.00
           7             $59,400.00              $107,000.00

The inner level index is the numer index and the outer leve is the 'engineer'/ 'ivy league'

In [13]:
type(new_df.index)

pandas.core.indexes.multi.MultiIndex

In [14]:
type(eng.index)

pandas.core.indexes.range.RangeIndex

loc with multi index should use parenthesis ()

In [15]:
new_df.loc[('engineer',3)]

School Name                 Polytechnic University of New York, Brooklyn
School Type                                                  Engineering
Starting Median Salary                                       $62,400.00
Mid-Career Median Salary                                    $114,000.00
Name: (engineer, 3), dtype: object

In [16]:
eng.loc[3]

School Name                 Polytechnic University of New York, Brooklyn
School Type                                                  Engineering
Starting Median Salary                                       $62,400.00
Mid-Career Median Salary                                    $114,000.00
Name: 3, dtype: object

In [17]:
new_df.head()

                                             School Name  School Type  \
engineer 0   Massachusetts Institute of Technology (MIT)  Engineering
         1      California Institute of Technology (CIT)  Engineering
         2                           Harvey Mudd College  Engineering
         3  Polytechnic University of New York, Brooklyn  Engineering
         4                                  Cooper Union  Engineering

           Starting Median Salary Mid-Career Median Salary
engineer 0            $72,200.00              $126,000.00
         1            $75,500.00              $123,000.00
         2            $71,800.00              $122,000.00
         3            $62,400.00              $114,000.00
         4            $62,200.00              $114,000.00

For iloc just works the same with multi index dataframe

In [18]:
new_df.iloc[3]

School Name                 Polytechnic University of New York, Brooklyn
School Type                                                  Engineering
Starting Median Salary                                       $62,400.00
Mid-Career Median Salary                                    $114,000.00
Name: (engineer, 3), dtype: object

### Column Axis Concatenation

We want to reflect a side by side  in a new dataframe. The top five ivy league and engineering school that produce the highest earning graduates

In [19]:
ivies.sort_values(by='Starting Median Salary', ascending=False)[:5]

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
1,Princeton University,Ivy League,"$66,500.00","$131,000.00"
3,Harvard University,Ivy League,"$63,400.00","$124,000.00"
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00"
5,Cornell University,Ivy League,"$60,300.00","$110,000.00"
7,Columbia University,Ivy League,"$59,400.00","$107,000.00"

In [20]:
ivies3=ivies.sort_values(by='Starting Median Salary', ascending=True)[:5].reset_index(drop=True)

In [21]:
eng3=eng.sort_values(by='Starting Median Salary', ascending=True)[:5].reset_index(drop=True)

Easy virtual comparison:

In [22]:
pd.concat([ivies3,eng3],axis=1)

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Brown University,Ivy League,"$56,200.00","$109,000.00",Tennessee Technological University,Engineering,"$46,200.00","$80,000.00"
1,Dartmouth College,Ivy League,"$58,000.00","$134,000.00",Rochester Institute of Technology (RIT),Engineering,"$48,900.00","$84,600.00"
2,Yale University,Ivy League,"$59,100.00","$126,000.00",New Mexico Institute of Mining and Technology ...,Engineering,"$51,000.00","$93,400.00"
3,Columbia University,Ivy League,"$59,400.00","$107,000.00",Embry-Riddle Aeronautical University (ERAU),Engineering,"$52,700.00","$80,700.00"
4,Cornell University,Ivy League,"$60,300.00","$110,000.00",Wentworth Institute of Technology,Engineering,"$53,000.00","$96,700.00"

It is good to look at. But not very nice to work with!

### Difference between concat() and append()

- df.append() method is a dataframe instance method (so it must have a underlying dataframe)
- unlike pd.concat() can be used without underlying dataframe (or we can make a new dataframe with pd.concat())
- df.append() only operates along the index axis (axis =0), therfore can't do column addition

In [23]:
eng4=eng.copy()

STEM --> Science, Technology, Engineering and Math. Engineering is a STEM Degree

In [24]:
eng4['STEM']=True

In [25]:
pd.concat([ivies,eng4], join='inner').head(2)

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00"
1,Princeton University,Ivy League,"$66,500.00","$131,000.00"

'inner' indicates to pandas that we only want to see the columns that both dataframes have in common

### Uebung concat

- concatenate the liberal and state schools into a new dataframe
- what is the median starting salary in this new dataframe?
- create a short dataframe that shows the top 3 liberal arts and state schools that produce the highest (mid-carrer) earning graduates
- show the school name and mid-career median salary columns from each dataset side by side

In [26]:
ueb_concat=pd.concat([lib,state])

In [27]:
ueb_concat.head(2)

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Bucknell University,Liberal Arts,"$54,100.00","$110,000.00"
1,Colgate University,Liberal Arts,"$52,800.00","$108,000.00"

In [28]:
ueb_concat['Starting Median Salary'].replace(to_replace=['$',',',''], value='', regex=True,inplace=True)

In [29]:
ueb_concat['Starting Median Salary'].str[1:-4].astype(int).mean()

44469.36936936937

In [30]:
ueb_concat['Mid-Career Median Salary'].replace(to_replace='[$,]', value='', regex=True)

0      110000.00
1      108000.00
2      107000.00
3      107000.00
4      107000.00
          ...
170     59200.00
171     58200.00
172     56500.00
173     50600.00
174     43900.00
Name: Mid-Career Median Salary, Length: 222, dtype: object

In [31]:
lib2=lib.sort_values(by='Mid-Career Median Salary', ascending=False).iloc[:3,[0,3]].reset_index(drop=True)

In [32]:
state2=state.sort_values(by='Mid-Career Median Salary', ascending=False).iloc[:3,[0,3]].reset_index(drop=True)

In [33]:
pd.concat([lib2,state2], axis=1, keys=['liberal arts', 'state'])

                                    liberal arts                           \
                                     School Name Mid-Career Median Salary
0  Wesleyan University (Middletown, Connecticut)              $97,900.00
1                                  Bates College              $96,500.00
2                                  Union College              $95,800.00

                                    state
                              School Name Mid-Career Median Salary
0         University of California, Davis              $99,600.00
1  University of Colorado - Boulder (UCB)              $97,600.00
2  University of California, Irvine (UCI)              $96,700.00

### The merge() Method

The merge() method is very similar to SQL. This method is more flexible than concat and append method

In [34]:
reg=pd.read_csv('Data/regions.csv')

In [35]:
reg.head(2)

                                   School Name        Region
0  Massachusetts Institute of Technology (MIT)  Northeastern
1     California Institute of Technology (CIT)    California

In [36]:
pd.merge(df,reg).head(2)

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00",Northeastern
1,California Institute of Technology (CIT),Engineering,"$75,500.00","$123,000.00",California

The merging automatically happend by 'School Name', which happens to be the only column that present in both dataframes

### The left_on and right_on Parameters

In [37]:
sal=pd.read_csv('Data/mid_career_salaries.csv')

In [38]:
sal.head(2)

,school_name,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Massachusetts Institute of Technology (MIT),"$76,800.00","$99,200.00","$168,000.00","$220,000.00"
1,California Institute of Technology (CIT),NaN,"$104,000.00","$161,000.00",NaN

In [39]:
df.merge(sal, right_on='school_name', left_on='School Name').shape

(269, 9)

In [40]:
df.merge(sal, right_on='school_name', left_on='School Name').drop(columns=['school_name']).head(2)

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00","$76,800.00","$99,200.00","$168,000.00","$220,000.00"
1,California Institute of Technology (CIT),Engineering,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN

### Inner vs Outer Joins

how='inner':
- only the common keys are selected
- similar to set intersection

how='outer':
- all keys are selected
- similar to set union

In [41]:
ivies.merge(reg, how='inner').head(2)
#pd.merge(ivies,reg, how='inner') #this syntax works too

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00",Northeastern
1,Princeton University,Ivy League,"$66,500.00","$131,000.00",Northeastern

In [42]:
a={1,2,3}
b={3,4,5}

In [43]:
a.union(b)

{1, 2, 3, 4, 5}

In [44]:
a.intersection(b)

{3}

### Left vs Right Joins

In [45]:
pd.merge(ivies, reg, how='left').head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Region
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00",Northeastern
1,Princeton University,Ivy League,"$66,500.00","$131,000.00",Northeastern
2,Yale University,Ivy League,"$59,100.00","$126,000.00",Northeastern
3,Harvard University,Ivy League,"$63,400.00","$124,000.00",Northeastern
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00",Northeastern

### One-to-One vs One-to-Many Joins

One-to-One joins:
--> happens when each record in a dataframe is asscicated with one record in another dataset

One-to-Many joins --> wether we have duplicates in the respective key columns for the keys selected by the inner join operation

### Many-to-Many joins

This occurs when we have duplicates in the key columns from both the left and right object that are being merged

In [58]:
survey = pd.DataFrame({
    'School Type': ['Ivy League', 'Ivy League', 'Engineering', 'Engineering'],
    'Prestige':['High', 'Good', 'Good', 'Okay'],
    'Respondent':[1,2,3,4]
})
survey

   School Type Prestige  Respondent
0   Ivy League     High           1
1   Ivy League     Good           2
2  Engineering     Good           3
3  Engineering     Okay           4

In [59]:
ivies.head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00"
1,Princeton University,Ivy League,"$66,500.00","$131,000.00"
2,Yale University,Ivy League,"$59,100.00","$126,000.00"
3,Harvard University,Ivy League,"$63,400.00","$124,000.00"
4,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00"

Now we want to merge these two dataframes - survey and ivies

Notice in one thing that the 'School Type' column contain duplicate for both objects. Merging these two dataframes will produce many-to-many joins

In [60]:
print(f'survey: {survey.shape}')
print(f'ivies: {ivies.shape}')

survey: (4, 3)
ivies: (8, 4)

In [63]:
pd.merge(ivies,survey)

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Prestige,Respondent
0,Dartmouth College,Ivy League,"$58,000.00","$134,000.00",High,1
1,Dartmouth College,Ivy League,"$58,000.00","$134,000.00",Good,2
2,Princeton University,Ivy League,"$66,500.00","$131,000.00",High,1
3,Princeton University,Ivy League,"$66,500.00","$131,000.00",Good,2
4,Yale University,Ivy League,"$59,100.00","$126,000.00",High,1
5,Yale University,Ivy League,"$59,100.00","$126,000.00",Good,2
6,Harvard University,Ivy League,"$63,400.00","$124,000.00",High,1
7,Harvard University,Ivy League,"$63,400.00","$124,000.00",Good,2
8,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00",High,1
9,University of Pennsylvania,Ivy League,"$60,900.00","$120,000.00",Good,2
10,Cornell University,Ivy League,"$60,300.00","$110,000.00",High,1
11,Cornell University,Ivy League,"$60,300.00","$110,000.00",Good,2
12,Brown University,Ivy League,"$56,200.00","$109,000.00",High,1
13,Brown University,Ivy League,"$56,200.00","$109,000.00",Good,2
14,Columbia University,Ivy League,"$59,400.00","$107,000.00",High,1
15,Columbia University,Ivy League,"$59,400.00","$107,000.00",Good,2

In the survey dataframe we got two records for ivy league. In order to accomodate the survey data, each record that contains the ivy league school type is repeated. This repeated so many times as there are duplicates on the key column

Let's try to add more ivy league on the survey data

In [67]:
survey = survey.append(pd.Series({'School Type':'Ivy League', 'Prestige': 'Very High', 'Respondent':5}, name=4))

Without name (or index in this example) it will thorw an error

In [68]:
pd.merge(ivies,survey).shape

(24, 6)

Now the merged dataframe contains three times more data than the original ivies dataframe

### Join Cardinalities

1 -> 1:
eg: person <-> DNA
- Dual sided uniques: both merge objects contain unique values in the respective key

1 -> M:
eg: book - pages
- One of the merge objects contain non-unique values
- In the resulting pd.merge() the records are repeated M times

M -> M:
eg: book - autor
- Both merge objects contain non-unique values
- In the resulting pd.merge() the records are repeated M x M times

### Merging by Index

In [52]:
ivies4=ivies.set_index('School Name')

In [53]:
reg2=reg.set_index('School Name')

In [71]:
ivies4.merge(reg2, left_index=True, right_index=True).shape

(8, 4)

In [55]:
ivies4.merge(reg, left_index=True, right_on='School Name')

,School Type,Starting Median Salary,Mid-Career Median Salary,School Name,Region
86,Ivy League,"$58,000.00","$134,000.00",Dartmouth College,Northeastern
87,Ivy League,"$66,500.00","$131,000.00",Princeton University,Northeastern
88,Ivy League,"$59,100.00","$126,000.00",Yale University,Northeastern
89,Ivy League,"$63,400.00","$124,000.00",Harvard University,Northeastern
90,Ivy League,"$60,900.00","$120,000.00",University of Pennsylvania,Northeastern
91,Ivy League,"$60,300.00","$110,000.00",Cornell University,Northeastern
92,Ivy League,"$56,200.00","$109,000.00",Brown University,Northeastern
93,Ivy League,"$59,400.00","$107,000.00",Columbia University,Northeastern

### The join() Method

In [70]:
ivies4.join(reg2).shape

(8, 4)

The code above produces the same output as ivies4.merge(reg2, left_index=True, right_index=True), but shorter

So the join() method helps us to write shorter code and in cases where we need to merge objects by using at least one of the indices as key